[
  {
    "_id": "6727532ada58df574dcb626e",
    "title": "Lvls Above.",
    "startDate": "2024-03-01T00:00:00.000Z",
    "endDate": "2024-06-06T00:00:00.000Z",
    "technologiesUsed": [
      "Node.js",
      "MongoDB",
      "HTML",
      "CSS",
      "JavaScript",
      "EJS"
    ],
    "description": "\u003Cp\u003E\u003Cstrong\u003EThis project\u003C/strong\u003E&nbsp;is a comprehensive&nbsp;\u003Cstrong\u003Ee-commerce web application\u003C/strong\u003E&nbsp;developed using&nbsp;\u003Cstrong\u003ENode.js, Express\u003C/strong\u003E, and&nbsp;\u003Cstrong\u003EMongoDB\u003C/strong\u003E. It provides a platform for users to browse, search, and purchase products, as well as for administrators to manage listings and user roles. The application includes user authentication, product listings with reviews, an integrated email notification system, and an admin dashboard.\u003C/p\u003E\n\n\u003Chr /\u003E\n\u003Ch3\u003EKey Features\u003C/h3\u003E\n\n\u003Cp\u003EUser Authentication and Authorization\u003C/p\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EUsers can register and log in using&nbsp;\u003Cstrong\u003Elocal accounts\u003C/strong\u003E&nbsp;or&nbsp;\u003Cstrong\u003EGoogle OAuth\u003C/strong\u003E.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003ESession management\u003C/strong\u003E&nbsp;is handled with&nbsp;\u003Ccode\u003Eexpress-session\u003C/code\u003E&nbsp;and&nbsp;\u003Ccode\u003Econnect-mongo\u003C/code\u003E.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003ERole-based access control\u003C/strong\u003E&nbsp;allows administrators to manage content and user permissions.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EProduct Listings\u003C/p\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EDetailed product pages\u003C/strong\u003E&nbsp;include images, descriptions, pricing, sizes, colours, and types.\u003C/li\u003E\n\t\u003Cli\u003EUsers can&nbsp;\u003Cstrong\u003Esearch\u003C/strong\u003E&nbsp;and&nbsp;\u003Cstrong\u003Efilter\u003C/strong\u003E&nbsp;listings based on various criteria.\u003C/li\u003E\n\t\u003Cli\u003EAdmins have the ability to&nbsp;\u003Cstrong\u003Eadd, update, and delete product listings\u003C/strong\u003E.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EReviews and Ratings\u003C/p\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EAuthenticated users\u003C/strong\u003E&nbsp;can leave reviews and ratings for products.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EAggregate ratings\u003C/strong\u003E&nbsp;are calculated and displayed for each product.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EEmail Notifications\u003C/p\u003E\n\n\u003Cp\u003EThe application sends emails for various purposes, such as:\u003C/p\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EPurchase confirmations\u003C/strong\u003E&nbsp;with order details.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EOne-Time Passwords (OTP)\u003C/strong\u003E&nbsp;for account verification or password resets.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003ESubscription confirmations\u003C/strong\u003E.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003ECustom emails to subscriber lists\u003C/strong\u003E.\u003C/li\u003E\n\t\u003Cli\u003EEmail functionality is implemented using&nbsp;\u003Cstrong\u003ENodemailer\u003C/strong\u003E&nbsp;and integrates with&nbsp;\u003Cstrong\u003ESMTP services\u003C/strong\u003E.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EAdmin Dashboard\u003C/p\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EAdministrators can&nbsp;\u003Cstrong\u003Emanage user roles and permissions\u003C/strong\u003E.\u003C/li\u003E\n\t\u003Cli\u003EProvides functionality to&nbsp;\u003Cstrong\u003Egenerate and download Google Merchant XML feeds\u003C/strong\u003E&nbsp;for SEO.\u003C/li\u003E\n\t\u003Cli\u003EAccess to certain routes and actions is&nbsp;\u003Cstrong\u003Erestricted to admin users\u003C/strong\u003E.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Chr /\u003E\n\u003Ch3\u003EMiddleware and Validation\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\u003Cstrong\u003ECustom middleware functions\u003C/strong\u003E&nbsp;are used for authentication checks and validation of user inputs.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EData validation\u003C/strong\u003E&nbsp;ensures that only properly formatted data is processed and stored.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EFlash messages\u003C/strong\u003E&nbsp;provide feedback to users on their actions.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch3\u003EError Handling\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EThe application includes&nbsp;\u003Cstrong\u003Ecomprehensive error handling mechanisms\u003C/strong\u003E.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003ECustom error classes\u003C/strong\u003E&nbsp;and middleware capture and process errors.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EUser-friendly error pages\u003C/strong\u003E&nbsp;are displayed when issues occur.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Chr /\u003E\n\u003Ch3\u003ETechnologies Used\u003C/h3\u003E\n\n\u003Cp\u003E\u003Cstrong\u003EBackend:\u003C/strong\u003E\u003C/p\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\u003Cstrong\u003ENode.js\u003C/strong\u003E: JavaScript runtime for server-side development.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EExpress.js\u003C/strong\u003E: Web framework for building the application&#39;s backend.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EMongoDB with Mongoose\u003C/strong\u003E: NoSQL database for data storage and ORM.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003E\u003Cstrong\u003EAuthentication and Authorization:\u003C/strong\u003E\u003C/p\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EPassport.js\u003C/strong\u003E: Handles user authentication strategies (local and Google OAuth).\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003E\u003Cstrong\u003EEmail Services:\u003C/strong\u003E\u003C/p\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\u003Cstrong\u003ENodemailer\u003C/strong\u003E: Sends emails for notifications and confirmations.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003E\u003Cstrong\u003EFile Uploads and Processing:\u003C/strong\u003E\u003C/p\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EMulter\u003C/strong\u003E: Middleware for handling multipart/form-data for file uploads.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003ECloudinary (via configuration)\u003C/strong\u003E: Stores and serves uploaded images.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003E\u003Cstrong\u003EFrontend:\u003C/strong\u003E\u003C/p\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EEJS\u003C/strong\u003E: Templating engine for rendering dynamic HTML pages.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EBootstrap\u003C/strong\u003E: Frontend framework for responsive design and styling.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003ECustom CSS and JavaScript\u003C/strong\u003E: Enhances user experience and interactivity.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003E\u003Cstrong\u003EOther Libraries and Tools:\u003C/strong\u003E\u003C/p\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EAxios\u003C/strong\u003E: Makes asynchronous HTTP requests.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EXMLBuilder\u003C/strong\u003E: Generates XML feeds for Google Merchant.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EDotenv\u003C/strong\u003E: Loads environment variables from a&nbsp;\u003Ccode\u003E.env\u003C/code\u003E&nbsp;file.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EMiddleware Modules\u003C/strong\u003E: Custom middleware for various functionalities.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Chr /\u003E\n\u003Ch3\u003EProject Structure\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EControllers\u003C/strong\u003E: Handles the logic for different routes and functionalities, such as listings, reviews, purchases, subscriptions, and user management.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EModels\u003C/strong\u003E: Defines the data schema for MongoDB collections, including users, listings, reviews, purchases, and subscriptions.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003ERoutes\u003C/strong\u003E: Sets up the endpoints for the application, connecting URLs to controller actions.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EViews\u003C/strong\u003E: Contains EJS templates for rendering the frontend pages, including layouts, partials, and individual page templates.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EPublic Directory\u003C/strong\u003E: Hosts static files like CSS, images, JavaScript, and other assets accessible to users.\u003C/p\u003E\n\t\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003E\u003Cstrong\u003EUtilities and Configurations:\u003C/strong\u003E\u003C/p\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EMiddleware\u003C/strong\u003E: Custom middleware functions for authentication, validation, and error handling.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003ECloud Configuration\u003C/strong\u003E: Manages file storage settings for image uploads.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EEmail Service\u003C/strong\u003E: Configures and manages email functionalities using Nodemailer.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Chr /\u003E\n\u003Ch3\u003EConclusion\u003C/h3\u003E\n\n\u003Cp\u003EThis&nbsp;\u003Cstrong\u003Ee-commerce web application\u003C/strong\u003E&nbsp;showcases a full-stack implementation of an online store with advanced features. It highlights proficiency in backend development with&nbsp;\u003Cstrong\u003ENode.js\u003C/strong\u003E&nbsp;and&nbsp;\u003Cstrong\u003EExpress\u003C/strong\u003E, frontend rendering with&nbsp;\u003Cstrong\u003EEJS\u003C/strong\u003E&nbsp;and&nbsp;\u003Cstrong\u003EBootstrap\u003C/strong\u003E, database management with&nbsp;\u003Cstrong\u003EMongoDB\u003C/strong\u003E, and essential functionalities like&nbsp;\u003Cstrong\u003Euser authentication\u003C/strong\u003E,&nbsp;\u003Cstrong\u003Efile uploads\u003C/strong\u003E,&nbsp;\u003Cstrong\u003Eemail notifications\u003C/strong\u003E, and&nbsp;\u003Cstrong\u003Eadmin control panels\u003C/strong\u003E. The application is designed with&nbsp;\u003Cstrong\u003Escalability\u003C/strong\u003E&nbsp;and&nbsp;\u003Cstrong\u003Emaintainability\u003C/strong\u003E&nbsp;in mind, employing best practices in&nbsp;\u003Cstrong\u003Emiddleware usage\u003C/strong\u003E,&nbsp;\u003Cstrong\u003Eerror handling\u003C/strong\u003E, and&nbsp;\u003Cstrong\u003Ecode organisation\u003C/strong\u003E.\u003C/p\u003E",
    "videoLink": "https://res.cloudinary.com/dn42qkskw/video/upload/f_auto:video,q_auto/v1/Portfolio/yyqhuhsmv1quymug0was",
    "githubLink": "",
    "websiteLink": "https://www.lvlsabove.co.uk/",
    "Order": 1,
    "show": true,
    "__v": 0,
    "audioLink": ""
  },
  {
    "_id": "674c344ca2d5729e68c0a337",
    "title": "Hotel Booking Cancellation Prediction",
    "startDate": "2024-10-01T00:00:00.000Z",
    "endDate": "2024-12-15T00:00:00.000Z",
    "technologiesUsed": [
      "React",
      "Node.js",
      "TypeScript",
      "Tailwind CSS",
      "Python",
      "Flask",
      "scikit-learn",
      "Pandas",
      "NumPy",
      "SHAP"
     
    ],
    "description": "I developed a machine learning classifier to predict hotel booking cancellations using a real-world dataset from two prominent hotels in Portugal: a resort hotel and a city hotel. The dataset contains over&nbsp;\u003Cstrong\u003E100,000 booking records\u003C/strong\u003E&nbsp;from July 2015 to August 2017, encompassing more than&nbsp;\u003Cstrong\u003E30 features\u003C/strong\u003E&nbsp;extracted directly from the hotels&#39; databases.\u003C/p\u003E\n\n\u003Ch2\u003EProject Motivation\u003C/h2\u003E\n\n\u003Cp\u003EIn the hospitality industry, predicting cancellations is crucial due to the&nbsp;\u003Cstrong\u003Eperishable nature\u003C/strong\u003E&nbsp;of hotel room inventory. Unsold rooms represent lost revenue that cannot be recovered. High cancellation rates can significantly impact a hotel&#39;s revenue and operational planning. By accurately predicting cancellations, hotels can implement proactive strategies to mitigate financial losses, such as overbooking policies or targeted marketing efforts.\u003C/p\u003E\n\n\u003Ch2\u003EData Challenges\u003C/h2\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EData Quality Issues\u003C/strong\u003E: The dataset, being sourced directly from operational SQL databases, included inconsistencies, missing values, and other quality issues typical of real-world data.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EFeature Complexity\u003C/strong\u003E: With over 30 features, including both numerical and categorical variables, proper feature selection and engineering were vital to enhance model performance.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EImbalanced Classes\u003C/strong\u003E: The dataset had an imbalance between bookings that were canceled and those that weren&#39;t, requiring careful handling during model training.\u003C/p\u003E\n\t\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch2\u003EMethodology\u003C/h2\u003E\n\n\u003Ch3\u003EData Preprocessing\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EData Cleaning\u003C/strong\u003E: Handled missing values, corrected inconsistencies, and removed duplicates to ensure data integrity.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EFeature Engineering\u003C/strong\u003E: Created new features and transformed existing ones to better capture patterns related to cancellations.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EEncoding Categorical Variables\u003C/strong\u003E: Applied one-hot encoding to categorical features like&nbsp;\u003Ca href=\"vscode-file://vscode-app/Applications/Visual%20Studio%20Code.app/Contents/Resources/app/out/vs/code/electron-sandbox/workbench/workbench.html\" target=\"_blank\"\u003Ecountry\u003C/a\u003E,&nbsp;\u003Ca href=\"vscode-file://vscode-app/Applications/Visual%20Studio%20Code.app/Contents/Resources/app/out/vs/code/electron-sandbox/workbench/workbench.html\" target=\"_blank\"\u003Edistribution_channel\u003C/a\u003E, and&nbsp;\u003Ca href=\"vscode-file://vscode-app/Applications/Visual%20Studio%20Code.app/Contents/Resources/app/out/vs/code/electron-sandbox/workbench/workbench.html\" target=\"_blank\"\u003Edeposit_type\u003C/a\u003E.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003ENormalization\u003C/strong\u003E: Scaled numerical features to normalize the data for algorithms sensitive to feature scales.\u003C/p\u003E\n\t\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch3\u003EExploratory Data Analysis (EDA)\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EPattern Discovery\u003C/strong\u003E: Analyzed booking patterns, seasonality effects, and customer behaviors.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003ECorrelation Analysis\u003C/strong\u003E: Identified correlations between features and the target variable to inform feature selection.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EVisualization\u003C/strong\u003E: Used graphs and charts to visualize distributions and relationships within the data.\u003C/p\u003E\n\t\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch3\u003EModel Development\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EAlgorithm Selection\u003C/strong\u003E: Evaluated several algorithms including Decision Trees, Random Forests, and Gradient Boosting Machines.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EHandling Imbalanced Data\u003C/strong\u003E: Used techniques like&nbsp;\u003Cstrong\u003ESMOTE\u003C/strong\u003E&nbsp;(Synthetic Minority Over-sampling Technique) to address class imbalance.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EHyperparameter Tuning\u003C/strong\u003E: Optimized model parameters using grid search and cross-validation for better generalization.\u003C/p\u003E\n\t\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EModel Evaluation\u003C/p\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EPerformance Metrics\u003C/strong\u003E: Assessed models using accuracy, precision, recall, F1-score, and ROC-AUC score.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EValidation\u003C/strong\u003E: Performed k-fold cross-validation to ensure model robustness.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EModel Selection\u003C/strong\u003E: Chose the model that provided the best balance between performance and interpretability.\u003C/p\u003E\n\t\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch3\u003EInterpretation with SHAP Values\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EFeature Importance\u003C/strong\u003E: Utilized SHAP (SHapley Additive exPlanations) values to understand the impact of each feature on the predictions.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EAggregation\u003C/strong\u003E: Aggregated SHAP values for one-hot encoded features back to their original categorical features for clearer interpretation.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EVisualization\u003C/strong\u003E: Generated plots to illustrate the most influential features affecting booking cancellations.\u003C/p\u003E\n\t\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch2\u003EResults\u003C/h2\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EAccuracy Achieved\u003C/strong\u003E: The final model achieved an accuracy of&nbsp;\u003Cstrong\u003E77%\u003C/strong\u003E&nbsp;on the test dataset.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EKey Influencing Factors\u003C/strong\u003E:\u003C/p\u003E\n\n\t\u003Cul\u003E\n\t\t\u003Cli\u003E\n\t\t\u003Cp\u003E\u003Cstrong\u003ELead Time\u003C/strong\u003E: Longer lead times were associated with higher cancellation rates.\u003C/p\u003E\n\t\t\u003C/li\u003E\n\t\t\u003Cli\u003E\n\t\t\u003Cp\u003E\u003Cstrong\u003EDeposit Type\u003C/strong\u003E: Bookings with no deposit were more likely to be canceled.\u003C/p\u003E\n\t\t\u003C/li\u003E\n\t\t\u003Cli\u003E\n\t\t\u003Cp\u003E\u003Cstrong\u003EPrevious Cancellations\u003C/strong\u003E: Customers with prior cancellations had a higher likelihood of canceling again.\u003C/p\u003E\n\t\t\u003C/li\u003E\n\t\t\u003Cli\u003E\n\t\t\u003Cp\u003E\u003Cstrong\u003EDistribution Channel\u003C/strong\u003E: Online travel agencies had different cancellation patterns compared to direct bookings.\u003C/p\u003E\n\t\t\u003C/li\u003E\n\t\u003C/ul\u003E\n\t\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch2\u003EBackend and Frontend\u003C/h2\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EAPI Development\u003C/strong\u003E: Created a RESTful API using Flask to serve the model predictions.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EWeb Interface\u003C/strong\u003E: Built a user-friendly frontend using React where users can input booking details and receive predictions along with explanations.\u003C/p\u003E\n\t\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003E&nbsp;\u003C/p\u003E\n\n\u003Ch2\u003EImpact\u003C/h2\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EOperational Efficiency\u003C/strong\u003E: Hotels can forecast cancellations and adjust their inventory management accordingly.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003ERevenue Optimization\u003C/strong\u003E: By predicting cancellations, hotels can implement overbooking strategies to minimize revenue loss.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003ECustomer Satisfaction\u003C/strong\u003E: Understanding cancellation patterns helps in designing better policies and improving customer experience.\u003C/p\u003E\n\t\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch2\u003EConclusion\u003C/h2\u003E\n\n\u003Cp\u003EThis project showcases the practical application of machine learning in addressing real-world business challenges. By accurately predicting hotel booking cancellations, the model aids hotels in making informed decisions, optimizing revenue, and enhancing customer satisfaction.\u003C/p\u003E",
    "videoLink": "https://res.cloudinary.com/dn42qkskw/video/upload/v1733046826/Portfolio/uvdpl3udsp59gosv2pqh.mp4",
    "githubLink": "",
    "websiteLink": "https://hotel-bookings-cancellation-predication-1.onrender.com/",
    "Order": 1,
    "show": true,
    "__v": 0
  },
  {
    "_id": "6670b1acf2ebda2df57034d5",
    "title": "Wanderlust",
    "startDate": "2024-02-09T00:00:00.000Z",
    "endDate": "2024-03-10T00:00:00.000Z",
    "technologiesUsed": [
      "Node.js",
      "MongoDB",
      "HTML",
      "CSS",
      "JavaScript",
      "EJS",
      "SQL"
    ],
    "description": "\u003Ch3 style=\"color:#aaaaaa; font-style:italic\"\u003E\u003Csmall\u003EIt might take up to 90 seconds for our server to wake up from its nap\u003C/small\u003E\u003C/h3\u003E\n\n\u003Ch3\u003EWanderlust is a comprehensive web application designed to streamline the discovery and listing of unique travel accommodations and experiences. It enables users to create, update, search, and delete listings, as well as review others&#39; listings. The platform aims to connect travelers with memorable stays and experiences worldwide.\u003C/h3\u003E\n\n\u003Ch2\u003EFeatures\u003C/h2\u003E\n\n\u003Ch3\u003EUser Authentication\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003ESecure signup and login functionality, including session management.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch3\u003EListing Management\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EUsers can post new listings with details such as title, description, images, price, and location.\u003C/li\u003E\n\t\u003Cli\u003EUsers can edit or delete their listings.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch3\u003EImage Upload\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EIntegration with Cloudinary for image uploading and storage.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch3\u003ESearch Functionality\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EUsers can search for listings based on keywords like title, description, and location.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch3\u003EReviews\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EUsers can leave reviews on listings, including a rating and comments.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch3\u003EResponsive Design\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EThe application is fully responsive and provides a seamless experience on both desktop and mobile devices.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch2\u003ETechnologies Used\u003C/h2\u003E\n\n\u003Ch3\u003EFrontend\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EHTML\u003C/li\u003E\n\t\u003Cli\u003ECSS\u003C/li\u003E\n\t\u003Cli\u003EJavaScript\u003C/li\u003E\n\t\u003Cli\u003EEJS (templating engine)\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch3\u003EBackend\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003ENode.js\u003C/li\u003E\n\t\u003Cli\u003EExpress.js\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch3\u003EDatabase\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EMongoDB with Mongoose ODM\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch3\u003EAuthentication\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EPassport.js\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch3\u003EImage Storage\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003ECloudinary\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch3\u003EValidation\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EJoi\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch3\u003EStyling\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EBootstrap for responsive design\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch2\u003ECode Highlights\u003C/h2\u003E\n\n\u003Ch3\u003EMVC Architecture\u003C/h3\u003E\n\n\u003Cp\u003EWanderlust is organized using the Model-View-Controller (MVC) architecture to separate concerns and enhance maintainability.\u003C/p\u003E\n\n\u003Ch3\u003EMiddleware\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003ECustom middleware for authentication and authorization to protect routes and resources.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch3\u003EError Handling\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EComprehensive error handling to provide meaningful error responses to the user.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch2\u003EChallenges Overcome\u003C/h2\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EImplementing full-text search across multiple fields in MongoDB.\u003C/li\u003E\n\t\u003Cli\u003EManaging file uploads and integrating with a third-party cloud storage solution.\u003C/li\u003E\n\t\u003Cli\u003EEnsuring security and robustness in user authentication and data validation.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch2\u003ESkills Demonstrated\u003C/h2\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EFull-stack web development\u003C/li\u003E\n\t\u003Cli\u003EDatabase design and management\u003C/li\u003E\n\t\u003Cli\u003EServer-side and client-side JavaScript\u003C/li\u003E\n\t\u003Cli\u003EAPI integration\u003C/li\u003E\n\t\u003Cli\u003ESecurity best practices in web development\u003C/li\u003E\n\t\u003Cli\u003EResponsive web design\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch2\u003EArchitectural Framework: MVC (Model-View-Controller)\u003C/h2\u003E\n\n\u003Ch3\u003EModel\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EHandles data and business logic. In Wanderlust, models are used for defining data schemas and interacting with the MongoDB database using Mongoose.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch3\u003EView\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EResponsible for displaying data to the user. The application uses EJS templates to generate HTML dynamically based on the data received from the server.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch3\u003EController\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EActs as an intermediary between models and views. It processes incoming requests, manipulates data through models, and sends output to the browser by rendering views.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EUsing the MVC framework enhances the maintainability of the application by promoting organized and modular code. It also facilitates easier debugging and testing by segregating the application into manageable components.\u003C/p\u003E",
    "videoLink": "https://res.cloudinary.com/dn42qkskw/video/upload/v1718660891/Portfolio/btkrwjildyux9zugru31.mp4",
    "__v": 0,
    "githubLink": "",
    "websiteLink": "https://airbnb-clone-8gmp.onrender.com/",
    "Order": 2,
    "userId": "6677edd2c907bb09a4568cac",
    "show": true,
    "apiKey": "c09d02f4-7290-4920-828c-b47a3b4f0fcf",
    "audioLink": "https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/1899903972&color=%23d4d4dc"
  },
  {
    "_id": "66d49d99ceb40144c5b71b0a",
    "title": "CommAI",
    "startDate": "2024-08-27T00:00:00.000Z",
    "endDate": "2024-09-01T00:00:00.000Z",
    "technologiesUsed": [
      "React"
    ],
    "description": "\u003Cp\u003E\u003Cstrong\u003ECommAI\u003C/strong\u003E is a cutting-edge web application designed to revolutionize communication by simplifying the process of writing and managing emails and text messages. Leveraging advanced AI capabilities, this tool offers features like email summarization, smart reply suggestions, and automated content generation, making it indispensable for users seeking to optimize their communication workflows.\u003C/p\u003E\n\n\u003Ch2\u003EKey Features\u003C/h2\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EAdvanced AI Integration\u003C/strong\u003E:&nbsp; &nbsp; - Powered by \u003Cstrong\u003EGoogle Generative AI\u003C/strong\u003E, CommAI intelligently generates and enhances email content based on user input, offering tailored suggestions and automated responses to streamline communication.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EIntuitive User Interface\u003C/strong\u003E:&nbsp; &nbsp; - Built with \u003Cstrong\u003EReact\u003C/strong\u003E and styled using \u003Cstrong\u003EChakra UI\u003C/strong\u003E and \u003Cstrong\u003EBootstrap\u003C/strong\u003E, the application delivers a clean, responsive interface that adapts seamlessly across all devices, ensuring a consistent user experience.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003ESeamless Speech Recognition\u003C/strong\u003E:&nbsp; &nbsp; - Features \u003Cstrong\u003Espeech-to-text functionality\u003C/strong\u003E through the \u003Ccode\u003Ereact-speech-recognition\u003C/code\u003E library, enabling users to dictate messages effortlessly, enhancing accessibility and convenience.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EInstant Feedback and Suggestions\u003C/strong\u003E:&nbsp; &nbsp; - Provides real-time feedback and smart suggestions as users compose their messages, boosting productivity and ensuring clear, effective communication.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EFlexible Custom Actions\u003C/strong\u003E:&nbsp; &nbsp; - Offers customizable actions where users can choose from predefined options or specify their needs, making the tool versatile for tasks like email summarization, replying, or drafting new messages.\u003C/p\u003E\n\t\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch2\u003ETechnologies Used\u003C/h2\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EFrontend\u003C/strong\u003E:&nbsp; &nbsp; - \u003Cstrong\u003EReact\u003C/strong\u003E: A powerful JavaScript library for building dynamic user interfaces. &nbsp; - \u003Cstrong\u003EVite\u003C/strong\u003E: A modern build tool that ensures a fast and efficient development environment. &nbsp; - \u003Cstrong\u003EChakra UI\u003C/strong\u003E: A comprehensive component library that provides accessible and customizable UI components. &nbsp; - \u003Cstrong\u003EBootstrap\u003C/strong\u003E: A widely-used CSS framework for creating responsive designs.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EAI Integration\u003C/strong\u003E:&nbsp; &nbsp; - \u003Cstrong\u003EGoogle Generative AI\u003C/strong\u003E: A sophisticated AI model that enhances and generates text content, driving the application&rsquo;s intelligent features.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EState Management\u003C/strong\u003E:&nbsp; &nbsp; - Implements \u003Cstrong\u003EReact Hooks\u003C/strong\u003E for efficient management of component state and side effects, ensuring a smooth user experience.\u003C/p\u003E\n\t\u003C/li\u003E\n\t\u003Cli\u003E\n\t\u003Cp\u003E\u003Cstrong\u003EStyling\u003C/strong\u003E:&nbsp; &nbsp; - Custom styles are meticulously applied using CSS Modules and inline styles, resulting in a sleek, modern aesthetic.\u003C/p\u003E\n\t\u003C/li\u003E\n\u003C/ul\u003E",
    "videoLink": "https://res.cloudinary.com/dn42qkskw/video/upload/v1725209203/Portfolio/aegqfrxyzdj08di8ldou.mp4",
    "githubLink": "",
    "websiteLink": "https://commai.onrender.com/index.html",
    "Order": 2,
    "show": true,
    "__v": 0,
    "audioLink": "https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/1908169712&color=%23d4d4dc"
  },
  {
    "_id": "6678145dd334853f5ce5877f",
    "title": "SimonSays",
    "startDate": "2023-12-31T00:00:00.000Z",
    "endDate": "2024-01-01T00:00:00.000Z",
    "technologiesUsed": [
      "HTML",
      "CSS",
      "JavaScript"
    ],
    "description": "\u003Cp\u003ESimon Says is a classic memory and reflex game where players follow a sequence of colors and sounds. Test your memory skills and challenge yourself to see how far you can go in this fun and interactive game.\u003C/p\u003E\n\n\u003Ch2\u003EFeatures:\u003C/h2\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EInteractive gameplay with colorful buttons\u003C/li\u003E\n\t\u003Cli\u003ESound effects for each color to enhance the gaming experience\u003C/li\u003E\n\t\u003Cli\u003EScore tracking to monitor your progress\u003C/li\u003E\n\t\u003Cli\u003EResponsive design for seamless gameplay on different devices\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch2\u003ETechnologies Used:\u003C/h2\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EHTML, CSS, JavaScript for game development\u003C/li\u003E\n\t\u003Cli\u003EBootstrap for styling components\u003C/li\u003E\n\t\u003Cli\u003EMedia queries for responsive design\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch3\u003EHow to Play:\u003C/h3\u003E\n\n\u003Col\u003E\n\t\u003Cli\u003EPress any key or click the &quot;Start&quot; button to begin the game.\u003C/li\u003E\n\t\u003Cli\u003ERemember the sequence of colors and sounds shown by Simon.\u003C/li\u003E\n\t\u003Cli\u003EClick on the colored buttons to repeat the sequence.\u003C/li\u003E\n\t\u003Cli\u003EEach correct sequence increases your score.\u003C/li\u003E\n\t\u003Cli\u003EIf you make a mistake, the game ends, showing your score and the correct sequence.\u003C/li\u003E\n\t\u003Cli\u003EPress any key to start a new game and challenge yourself again.\u003C/li\u003E\n\u003C/ol\u003E\n\n\u003Cp\u003E\u003Cem\u003EEnjoy playing Simon Says and test your memory skills in this engaging game!\u003C/em\u003E\u003C/p\u003E",
    "videoLink": "https://res.cloudinary.com/dn42qkskw/video/upload/v1719251302/Portfolio/mx93yzne04qlq1vj9mcb.mp4",
    "githubLink": "https://github.com/sahil0902/Simon-Says",
    "websiteLink": "https://simonsays-9113.onrender.com",
    "Order": 3,
    "__v": 0,
    "show": true,
    "apiKey": "c09d02f4-7290-4920-828c-b47a3b4f0fcf"
  },
  {
    "_id": "667dc7d6047e8b50c0930725",
    "title": "Weather App 🌤️",
    "startDate": "2024-06-26T00:00:00.000Z",
    "endDate": "2024-06-27T00:00:00.000Z",
    "technologiesUsed": [
      "React",
      "HTML",
      "CSS",
      "JavaScript"
    ],
    "description": "\u003Cp\u003EThe Weather App is a modern, interactive weather application that provides users with real-time weather information. Built with React, Material-UI, and Mapbox GL, it utilizes the OpenWeatherMap API to fetch detailed weather data. Users can search for weather information by city name or use their current location to get updates.\u003C/p\u003E\n\n\u003Ch3\u003E\u003Cstrong\u003EKey Features:\u003C/strong\u003E\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\u003Cstrong\u003ECity-Based Search:\u003C/strong\u003E Users can input a city name to receive the latest weather details.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003ECurrent Location Updates:\u003C/strong\u003E The app can use the device&#39;s current location to fetch and display weather information.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EInteractive Globe:\u003C/strong\u003E The app includes a Mapbox GL interactive globe to visualize the searched or current location.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EDetailed Weather Information:\u003C/strong\u003E Displays comprehensive weather data including temperature, feels-like temperature, minimum and maximum temperatures, humidity, and weather description.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EResponsive Design:\u003C/strong\u003E The application is fully responsive, ensuring a seamless experience across various devices.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch3\u003E\u003Cstrong\u003ETechnologies Used:\u003C/strong\u003E\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EReact:\u003C/strong\u003E For building the user interface.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EMaterial-UI:\u003C/strong\u003E For styling and UI components.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EMapbox GL:\u003C/strong\u003E For the interactive map and geolocation features.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EOpenWeatherMap API:\u003C/strong\u003E For fetching real-time weather data.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EAxios:\u003C/strong\u003E For making API requests.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Ch3\u003E\u003Cstrong\u003EChallenges and Learnings:\u003C/strong\u003E\u003C/h3\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EImplementing geolocation features to fetch and display the user&#39;s current weather.\u003C/li\u003E\n\t\u003Cli\u003EIntegrating Mapbox GL for interactive map functionalities.\u003C/li\u003E\n\t\u003Cli\u003EHandling asynchronous API requests and managing state efficiently in a React application.\u003C/li\u003E\n\u003C/ul\u003E",
    "videoLink": "https://res.cloudinary.com/dn42qkskw/video/upload/v1719742642/Portfolio/fqgwaifruxrzznnhj9wo.mp4",
    "githubLink": "https://github.com/sahil0902/WeatherApp",
    "websiteLink": "https://weatherapp-roln.onrender.com/",
    "Order": 3,
    "show": true,
    "__v": 0,
    "apiKey": "c09d02f4-7290-4920-828c-b47a3b4f0fcf"
  },
  {
    "_id": "671e779c77a61ee150f1e0d8",
    "title": "Spotify Frotnend Clone",
    "startDate": "2023-01-10T00:00:00.000Z",
    "endDate": "2023-01-10T00:00:00.000Z",
    "technologiesUsed": [
      "HTML",
      "CSS",
      "JavaScript"
    ],
    "description": "\u003Cp\u003Ehe&nbsp;Spotify-Design-Clone&nbsp;is&nbsp;a web-based music&nbsp;player that&nbsp;replicates&nbsp;the aesthetic&nbsp;and functionality&nbsp;of the&nbsp;popular&nbsp;music&nbsp;streaming&nbsp;service, Spotify. This project showcases&nbsp;my skills&nbsp;in frontend&nbsp;development, providing users&nbsp;with an&nbsp;engaging interface&nbsp;to play and&nbsp;navigate&nbsp;through a&nbsp;curated playlist of songs.\u003C/p\u003E\n\n\u003Cp\u003EKey Features:\u003C/p\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EResponsive&nbsp;Design:&nbsp;The application is designed to&nbsp;be&nbsp;fully responsive, ensuring a&nbsp;seamless&nbsp;experience across&nbsp;various&nbsp;devices, including desktops, tablets, and smartphones.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EMusic&nbsp;Playback:&nbsp;Users can&nbsp;play, pause, and skip&nbsp;songs, allowing for&nbsp;an&nbsp;interactive&nbsp;music listening experience.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EDynamic&nbsp;User Interface:&nbsp;The interface dynamically updates&nbsp;to display&nbsp;the current&nbsp;song&#39;s&nbsp;title, artist, and&nbsp;cover art, enhancing user&nbsp;engagement.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EProgress Bar:&nbsp;A&nbsp;visual&nbsp;progress bar indicates the playback&nbsp;status, showing&nbsp;users&nbsp;how much of the song has&nbsp;played and how much is&nbsp;left.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EVolume&nbsp;Control:&nbsp;Users&nbsp;can&nbsp;easily adjust the volume using a range input, providing a&nbsp;personalized listening&nbsp;experience.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003ETechnologies Used:\u003C/p\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EHTML:&nbsp;For structuring the web pages&nbsp;and content.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003ECSS:&nbsp;For&nbsp;styling the&nbsp;application and ensuring a&nbsp;visually&nbsp;appealing&nbsp;layout.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003EJavaScript:&nbsp;For implementing functionality, including audio playback and dynamic&nbsp;updates&nbsp;to the UI.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003E&nbsp;\u003C/p\u003E\n\n\u003Cp\u003E&nbsp;\u003C/p\u003E",
    "videoLink": "https://res.cloudinary.com/dn42qkskw/image/upload/v1730049177/Portfolio/cpete5xk7n8veruckke7.jpg",
    "githubLink": "https://github.com/sahil0902/Spotify_Clone",
    "websiteLink": "https://sahil0902.github.io/Spotify_Clone/",
    "Order": 3,
    "show": true,
    "__v": 0,
    "audioLink": "https://res.cloudinary.com/dn42qkskw/video/upload/v1730050412/Portfolio/hltid8nirclg6xvxbhex.mov"
  },
  {
    "_id": "6724f8e70c92ba13c44c193b",
    "title": "Pakistan Society Website - University of Huddersfield",
    "startDate": "2024-10-31T00:00:00.000Z",
    "endDate": "2024-11-01T00:00:00.000Z",
    "technologiesUsed": [
      "React"
    ],
    "description": "\u003Cp\u003EThe&nbsp;\u003Cstrong\u003EPakistan Society Website\u003C/strong\u003E&nbsp;is a dynamic and responsive web application developed for the University of Huddersfield&#39;s Pakistani Society. Built with React and Material-UI, the website offers an engaging user experience with features such as:\u003C/p\u003E\n\n\u003Cul\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EInteractive Tour Guide:\u003C/strong\u003E&nbsp;Utilizing&nbsp;\u003Ccode\u003Ereact-joyride\u003C/code\u003E&nbsp;to guide new users through key sections, enhancing onboarding and user navigation.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EResponsive Design:\u003C/strong\u003E&nbsp;Ensures optimal performance and appearance across various devices, including desktops and mobile phones.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003ECommittee Showcase:\u003C/strong\u003E&nbsp;Displays detailed profiles of committee members, fostering transparency and community engagement.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EEvent Management:\u003C/strong\u003E&nbsp;Integrates dynamic event listings fetched using Axios, keeping members updated with the latest society activities.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003EStudent Verification:\u003C/strong\u003E&nbsp;Implements a secure OTP-based verification system, enabling students to confirm their status and access exclusive features.\u003C/li\u003E\n\t\u003Cli\u003E\u003Cstrong\u003ESmooth Animations:\u003C/strong\u003E&nbsp;Employs Framer Motion for seamless transitions and animations, enhancing the overall user experience.\u003C/li\u003E\n\u003C/ul\u003E\n\n\u003Cp\u003EThis project demonstrates proficiency in modern frontend technologies and a strong focus on user-centric design, effectively supporting the society&#39;s goals of increasing engagement and streamlining communication.\u003C/p\u003E",
    "videoLink": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTaCjvjg8tGUhvMEiA_jYJfpNWujvnNmJgMZQ&s",
    "githubLink": "",
    "websiteLink": "https://paksoc.onrender.com/",
    "Order": 3,
    "show": true,
    "__v": 0,
    "audioLink": ""
  }
]
